app/controllers/purchases_controller.rb

  def index
    @purchases = Purchase.all
---
SELECT "purchases".* FROM "purchases"

  def create
    @purchase = Purchase.new(purchase_params)

    respond_to do |format|
      if @purchase.save
---
INSERT INTO "purchases" ("name", "cost", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Thing1"], ["cost", 300.0], ["created_at", "2015-10-14 14:05:50.316472"], ["updated_at", "2015-10-14 14:05:50.316472"]]

  def update
    respond_to do |format|
      if @purchase.update(purchase_params)
---
UPDATE "purchases" SET "cost" = ?, "updated_at" = ? WHERE "purchases"."id" = ?  [["cost", 3099.0], ["updated_at", "2015-10-14 14:27:20.977972"], ["id", 1]]

  def destroy
    @purchase.destroy
---
DELETE FROM "purchases" WHERE "purchases"."id" = ?  [["id", 1]]

    def set_purchase
      @purchase = Purchase.find(params[:id])
---
SELECT  "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT 1  [["id", 1]]